#  + створити діапазон з старт стоп та крок, потім виконати ітерацію по цьому діапазону
#  + з застосуванням цикла for , і в циклі записсувати елементи  діапазона в список,
#  + а список треба створити до циклу for

# 1. Створюємо діапазон
my_range = range(2, 22, 4)  # старт=2, стоп=22, крок=4

# 2. Створюємо пустий список до циклу
my_list = []

# 3. Ітеруємо по діапазону та додаємо елементи до списку
for n in my_range:
    my_list.append(n)

# 4. Виводимо результат
print(my_list)  #  [2, 6, 10, 14, 18]
