# 7.14

#  + Task
#  1. Створить набір з декількох елементів типу int
#  2. Додайте до нього ще один елемент
#  3. Створить ще один набір з декількома елементами, деякі повинні бути такими ж як і в першому
#  4. Знайдіть загальні елементи у двох наборах та розмістить їх у новому наборі
#  5. Конвертуйте результівний набір в список та вивести у термінал


print(nums_first := {25, 8, 14, 26, 10})
print(nums_second := {25, 2, 100, 55, 10, 33, 111})

print(nums_first.add(23))  # type: ignore    # _____НЕ РЕКОМЕНДОВАНО________
print(nums_first | {23})  # аналог union(), але коротше

print((nums_common := nums_second & nums_first))

print(nums_list := list(nums_common))


# {8, 10, 25, 26, 14}  # nums_first
# {33, 2, 100, 55, 10, 111, 25}  # nums_second
# {10, 25}  # nums_common
# [10, 25]  # nums_list
