# ======================== TASK-1 ===============================

# Напишите программу, которая:
#
# получает на вход строку чисел, разделенных запятыми;
# формирует из чисел два списка — с четными и нечетными числами;
# выводит списки без скобок на отдельных строках.
# Пример ввода:
#
# 3,4,2,7,8,9,1,11,2,56,2,6,81
#
# Вывод:
#
# 3 7 9 1 11 81
#
# 4 2 8 2 56 2 6

# ----------------------  Рішення  -----------------------------

# Приймаємо ввід від користувача
# try:
#     st = [int(i) for i in input("Введіть числа через кому: ").split(",")]
#
#     # Створюємо списки для непарних і парних чисел
#     lst_odd = [i for i in st if i % 2 != 0]
#     lst_even = [i for i in st if i % 2 == 0]
#
#     # Виводимо непарні та парні числа
#     print("Непарні числа:", *lst_odd)
#     print("Парні числа:", *lst_even)
#
# except ValueError:
#     print("Будь ласка, введіть тільки числа, розділені комами.")

# -----------------------------  Ще приклад  -----------------------------------


# try:
#     x = 1 / 0  # Помилка: ділення на нуль
# except ZeroDivisionError:
#     print("Помилка: ділення на нуль!")

#     =================================================================
#
# region important

# Завдання 1: Основи роботи зі списками
# Створи список із назвою fruits, який містить такі елементи: "яблуко", "банан", "апельсин", "ківі".
#
# Виведи на екран перший елемент списку.
#
# Виведи на екран останній елемент списку.
#
# Додай до списку новий фрукт "манго" і виведи оновлений список.
#
# Видали другий елемент списку і виведи оновлений список.


# fruits = ["яблуко", "банан", "апельсин", "ківі"]
# print(fruits[0])
# print(fruits[-1])
#
# fruits.append("манго")
# print(fruits)
#
# fruits.pop(2)
# print(fruits)
#
# print(f"Перший елемент: {fruits[0]}")
# print("Перший елемент:", fruits[0])

# endregion

# region impotant


# --------------------Task I -----------------

# mixed_list = [23, "Andrii", 3.14, True, 369]  # список з різними типами даних
# print(mixed_list)

# mixed_list.pop(2)  #  видаляємо 3-й елемент (це індекс [2])

# print(len(mixed_list))  # перевірка довжини
# print(mixed_list)

# mixed_list.reverse()  #  перегортаємо реверсом
# print(mixed_list)


# rev_list = mixed_list[::-1]  # перегортаємо зрізом
# print(rev_list)


# other_list = [999, "audi"]  # створюємо інший список

# mixed_list.extend(other_list)  #  додаємо інший список до першого
# print(mixed_list, len(mixed_list), sep="\n")


# --------------------Task II -----------------

# first_list = [1, 2, 3, 4]  #  створюємо перший список

# second_list = [11, 22, 33, 44]  #  створюємо другий список

# concatenated_list = first_list + second_list  #  конкатенація

# print(concatenated_list)


# concatenated_list = first_list.__add__(second_list)  #
# concatenated_reverse_list = second_list.__add__(first_list)  #

# print(concatenated_list)
# print(concatenated_reverse_list)


# --------------------Task III -----------------

# while True:    
#     try:
#         a = float(input("Введіть число: "))
#         b = float(input("Введіть число: "))
#     except ValueError:
#         print("Помилка: ділення на нуль!")
#         break
# c = a+b
# print(c)
